devicesAndGroups.yml
config:
  target: 'http:/'
  plugins:
      expect: {}    
  phases:
    - duration: 5
      arrivalRate: 1
      maxVusers: 1
  defaults:
    headers:
      authorization: 'a'
  processor: './functions.js'

scenarios:
  - 
      name: 'GET Devices and Groups'
      flow:
        - log: 'POST Login'
        - post:
            url: '/pm-user-management:3000/api/v1/auth/login'
            json:
                username: 'adriana'
                password: '123456'
            capture:
                - json: '$.token.access_token'
                  as: 'auth_token'
            expect:
                - statusCode: 200
                - contentType: json
                - hasProperty: token
        - log: 'GET Devices and Groups'
        - get:
            url: '/system-management:8080/sm/api/v1/group-management/groups/devices'
            headers:
              authorization: 'Bearer {{ auth_token }}'
            expect:
              - statusCode: 200